# спросить у пользователя год рождения А.С Пушкина
while True:
    year = int(input("Введите год рождения А.С.Пушкина:"))
    # проверяем верный ли год ввел пользователь
    if year == 1799:
        print("Верный год")
        # если год верный, спрашиваем число дня рождения
        while True:
            day = int(input("Введите день рождения А.С.Пушкина (число):"))
            if day == 6:
                print("Верное число дня рождения")
        # выходим из цикла
                break
            else:
                print("Неверное число дня, попробуйте снова")
        break  # выходим из цикла
    else:
        print("Неверный год, попробуйте снова")
